<details><summary>Digger run report at 2023-09-16 22:57:06 (UTC)</summary>
  <details><summary>Apply for <b>puneet-arora15/test#dev</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_role.test_role will be created
  + resource "aws_iam_role" "test_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "tag-value"
        }
      + tags_all              = {
          + "tag-key" = "tag-value"
        }
      + unique_id             = (known after apply)
    }

  # null_resource.test_de222222262 will be created
  + resource "null_resource" "test_de222222262" {
      + id = (known after apply)
    }

  # null_resource.test_dev will be created
  + resource "null_resource" "test_dev" {
      + id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
null_resource.test_dev: Creating...
null_resource.test_de222222262: Creating...
null_resource.test_dev: Creation complete after 0s [id=6312014494555780001]
null_resource.test_de222222262: Creation complete after 0s [id=8391957344646402190]
aws_iam_role.test_role: Creating...
aws_iam_role.test_role: Creation complete after 1s [id=test_role]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

  ```
</details>
</details>